{"id":302,"date":"2017-11-10T11:16:06","date_gmt":"2017-11-10T11:16:06","guid":{"rendered":"http:\/\/qantumthemes.xyz\/fluid\/demo2\/?p=302"},"modified":"2017-11-10T11:16:06","modified_gmt":"2017-11-10T11:16:06","slug":"house-and-electronic-dance-music-djs-use-a-playlist-or-tracklist-on-all-your-mixes-2","status":"publish","type":"post","link":"https:\/\/vice.qantumthemes.xyz\/dhrk\/dj-life\/house-and-electronic-dance-music-djs-use-a-playlist-or-tracklist-on-all-your-mixes-2\/","title":{"rendered":"House and Electronic Dance Music DJs &#8211; Use a Playlist"},"content":{"rendered":"<div id=\"article-content\">\n<p><b>A Tracklist Will Help You Get Found<\/b><br \/>\nIncluding a tracklist or playlist with your mix sets is an essential part of promoting your career as a performing artist. Whether you&#8217;re just starting out or a seasoned pro, a proper play list is the best way to ensure your mix sets are easily found by house heads worldwide. With each tracklist, you provide Google an opportunity to index key search terms such as song title, artist, remixer, and label. Use this as a tool to be found by fans that follow and support the same style as you. Technically speaking, a playlist will promote your mix even when you&#8217;re asleep!<\/p>\n<p>In the world of house music, there are thousands of underground, unsigned, and aspiring artists it&#8217;s amazing how much music never makes it to the mainstream market. Even then, what our culture considers &#8220;mainstream&#8221; is still considered &#8220;underground&#8221; in the world of major labels. It&#8217;s important that your listeners identify where the music is coming from, so that their hard work is in the spotlight as well.<\/p>\n<p><b>Playlists are an Industry Standard<\/b><br \/>\nHouse and electronic dance music has always been about discovering new music. As a DJ\/Artist, it is your duty to educate your fans and audience. Don&#8217;t be afraid to include a playlist with all your mixes &#8211; It&#8217;s an industry standard and without one you can easily be misinterpreted as lazy or holding back.<\/p>\n<p>Minimum format: ARTIST &#8211; TITLE<br \/>\nPreferred format: ARTIST &#8211; TITLE &#8211; REMIXER &#8211; LABEL<br \/>\nExample: DJ Smith feat Mary Jones &#8211; &#8220;It&#8217;s getting funky&#8221; (Funklord Club Remix) &#8211; K1 Music<\/p>\n<p><b>Show Your Support<\/b><br \/>\nIt&#8217;s rare that you will become a world renown artist based solely on your DJ sets. Most disc jockeys do more than just play music. They often have a combination of elements working for them including a radio show, remix\/production, a club residency, promoting their own night\/event, or a record label. A natural progression for many DJs is getting into music production or remixing. One day, your music will be a part of someone else&#8217;s mix, and you certainly hope they give you proper recognition. Show your support and make sure you acknowledge their talent by including their information on your playlist.<\/p>\n<p><b>Our Future Depends on You<\/b><br \/>\nWith a tracklist you are providing a service to the artist or label in the event the listener wants to buy that song\/track. Whether you&#8217;re a fan or DJ &#8211; Think about the all the times you&#8217;ve listened to a mix, and NEEDED to buy a certain song. You found out what it was, and you bought it on iTunes, Amazon, Traxsource, Beatport, or your favorite digital music store. With a proper tracklist, you&#8217;re saying YES to the future of the digital music industry.<\/p>\n<\/div>\n<div id=\"article-resource\">\n<p>Brian Cabalic has been selecting music for the dance floor since 1989. He graduated from UCSD with a degree in Human Development and currently works as a Network Engineer and DJ. Brian has successfully combined his passion for house music, knack for technology, and knowledge of human behavior as the Webmaster for [http:\/\/www.ilovehousemusic.com]. The site is a social network dedicated to the progress of house music culture and electronic dance music through online interaction. Sign up today for a FREE Artist or Fan account to learn more about house music and underground dance culture.<\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>A Tracklist Will Help You Get Found Including a tracklist or playlist with your mix sets is an essential part of promoting your career as a performing artist. Whether you&#8217;re just starting out or a seasoned pro, a proper play list is the best way to ensure your mix sets ...<\/p>\n","protected":false},"author":1,"featured_media":717,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[3],"tags":[2,4,5],"_links":{"self":[{"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/posts\/302"}],"collection":[{"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/comments?post=302"}],"version-history":[{"count":0,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/posts\/302\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/media\/717"}],"wp:attachment":[{"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/media?parent=302"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/categories?post=302"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/tags?post=302"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}