{"id":306,"date":"2017-11-10T11:17:13","date_gmt":"2017-11-10T11:17:13","guid":{"rendered":"http:\/\/qantumthemes.xyz\/fluid\/demo2\/?p=306"},"modified":"2017-11-10T11:17:13","modified_gmt":"2017-11-10T11:17:13","slug":"ibiza-dance-music-a-history-of-dance-music-in-ibiza","status":"publish","type":"post","link":"https:\/\/vice.qantumthemes.xyz\/dhrk\/dj-life\/ibiza-dance-music-a-history-of-dance-music-in-ibiza\/","title":{"rendered":"Ibiza Dance Music &#8211; A History of Dance Music"},"content":{"rendered":"<div id=\"article-content\"><\/div>\n<p>Music centers can break out in the must unlikely places. Take the small Balearic Island of Ibiza, for example. When people think of island vacations, they likely picture sandy beaches, rolling waves, and drinking cool beverages under the hot sun. In other words, they dream about enjoying the great outdoors.<\/p>\n<p>However, it&#8217;s the great indoors, instead, that makes Ibiza a coveted destination for dance music aficionados all over the world.<\/p>\n<p>Much like latter day world explorers, hippies arrived in Ibiza in the &#8217;60s, bringing with them musical styles not yet heard in Spain. And in 1973, Pacha Ibiza, the island&#8217;s first pivotal club, began to attract music-loving night owls. Soon after, rising musicians from around the globe were flocking to this sonic melting pot, and eventually many other popular night spots took root, including Es Paradis and Amnesia.<\/p>\n<p>In the &#8217;90s, dance music began to evolve at a rapid rate, similar to the way the internet and personal computers started fast-forwarding our culture into its brave new future. And when the electronic dance movement started to take shape via house, trance, techno and other keyboard and computerized styles, DJs in the Ibiza club scene took on the role of turntablest agents of change. There&#8217;s even a genre named after the island, called Balearic Beat, and this indigenous Ibiza music is notable for its strong grooves, which are mixed in with distinctly Spanish influences.<\/p>\n<p>One of Ibiza&#8217;s best known performers is Jens Gad, who was featured prominently on Enigma&#8217;s recordings. Tiësto, another Ibiza regular, was the first DJ to perform at the Athens Summer Olympic Games in 2004. Paul van Dyk may be from East Berlin, but his electronic dance music always goes over extremely in Ibiza. John Digweed regularly performs at hot spots, such as Space, and hosts his own radio show, Transitions. Other notable DJs include Above and Beyond, who are appreciated for their uplifting trance sounds, also host the radio show Trance Around the World and have had residencies at Cream, A&amp;B, and others. Markus Schulz is also from Germany, and like many of his DJ contemporaries, hosts his own radio show, which is called Global DJ Broadcast.<\/p>\n<p>Ibiza is more than just a DJs paradise, however, as nearly any and all musical varieties are now openly welcomed there. It&#8217;s so eclectic in fact many clubs designate rooms solely for certain musical styles, which range from Latin and garage, to R&amp;B and hip-hop. Live music is also alive and well in the Ibiza calendar, as Kaiser Chiefs, The Arctic Monkeys, and Kasabian have all made notable island ventures, brandishing electric guitars, instead of turntables and various electronic wizardry. Much like major creative cities, such as New York, London, and Los Angeles, Ibiza attracts visitors from around the world. These other major metropolises may dwarf the island, size-wise, but Ibiza&#8217;s adventurous sense of experimentation makes it just as important as any other music capital. Those with ears to hear that want to explore the great indoors must put Ibiza on their travel itinerary.<br \/>\nThis article was written by John McElborough. Find out more about Ibiza and book your room at the Ibiza Rocks Hotel &#8211; Ibiza&#8217;s number one music hotel for clubbers on loveibiza.net.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Music centers can break out in the must unlikely places. Take the small Balearic Island of Ibiza, for example. When people think of island vacations, they likely picture sandy beaches, rolling waves, and drinking cool beverages under the hot sun. In other words, they dream about enjoying the great outdoors. ...<\/p>\n","protected":false},"author":1,"featured_media":723,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[3],"tags":[7,8],"_links":{"self":[{"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/posts\/306"}],"collection":[{"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/comments?post=306"}],"version-history":[{"count":0,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/posts\/306\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/media\/723"}],"wp:attachment":[{"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/media?parent=306"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/categories?post=306"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/tags?post=306"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}