{"id":308,"date":"2017-11-10T11:17:41","date_gmt":"2017-11-10T11:17:41","guid":{"rendered":"http:\/\/qantumthemes.xyz\/fluid\/demo2\/?p=308"},"modified":"2017-11-10T11:17:41","modified_gmt":"2017-11-10T11:17:41","slug":"the-past-future-of-dance-music-styles","status":"publish","type":"post","link":"https:\/\/vice.qantumthemes.xyz\/dhrk\/club-music\/the-past-future-of-dance-music-styles\/","title":{"rendered":"The Past &#038; Future of Dance Music Styles"},"content":{"rendered":"<p>Some say the origin of House music came out of Chicago in 1981. An escape from street and gang life, house music offered temperance to the unsettled consciousness of youth at the time. It allowed them to mingle with peers, while dancing away any of their problems.<\/p>\n<p>Techno music, which some say, came out of Detroit in the early 90&#8217;s, may have begun through the evolutionary progress of various new textures, patterns and sounds which were emerging from all over the world.<\/p>\n<p>New electronic music devices were being created while electronic sounds were coming into their own. The kick and snare became the heartbeat of the song. The bass became the backbone driving force. The synthesizer was the melody which brought people into the nightclub doors, and kept them dancing from dusk to dawn.<\/p>\n<p>Over the years, some of the different genres and sub styles which have emerged with this new sound have been called: Deep House, House, Techo, Megabeat, Electro House, Disco House, Funky House, Garage, Techno, Industrial, Electronica, Breakcore, Micro-house, Underground, Trance, Ambient, Breaks, Minimal Techno, and many more.<\/p>\n<p>But in looking at where we are now, it was the music groups from as far back as the 60&#8217;s that were the veterans of this new sound. Bands like &#8220;The Tornados&#8221; created one of the first techno-pop songs entitled Telstar in 1962, which became a Billboard number one hit for the band. The song featured a Clavioline, an instrument like a keyboard with a very distinctive electronic sound. Telstar was the first U.S. number one hit by a British group. The song was originally thought to be just a novelty record intended to make people think about the dawn of the space age. Little did they know at the time how evolutionary their record would become.<\/p>\n<p>Since then, DJ&#8217;s and Re-mixers (both male and female) have come on the dance music scene, creating an entirely new sound of the future. With their flair for remixing different sounds, cuts and beats, many DJ&#8217;s have created number one dance singles. In doing so, they have developed a new artistry and way for them to be heard by music industry power players. Further, they continue to compete at becoming the best mixers and most popular DJ&#8217;s in the clubs. In their own right, they have become the celebrities.<\/p>\n<p>With respect to all forms of music and genres introduced, there is no one sound or genre which now stands alone. Music is as diverse as the creators&#8217; imagination. But groundbreakers, such as The Tornados and Kraftwerk have helped to pave the way.<\/p>\n<p>Stay tuned, because the next groundbreakers are sitting in their studios (or sound proofed bedroom closets) right now creating the hottest &#8216;new sound&#8217; as we speak. And moving forward toward the future, who knows what those sounds will be entitled. Perhaps you will come up with the next new style yourself. If so, what will it be coined? The world&#8217;s audience will definitely be listening.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Some say the origin of House music came out of Chicago in 1981. An escape from street and gang life, house music offered temperance to the unsettled consciousness of youth at the time. It allowed them to mingle with peers, while dancing away any of their problems. Techno music, which ...<\/p>\n","protected":false},"author":1,"featured_media":718,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[6],"tags":[7,10,11],"_links":{"self":[{"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/posts\/308"}],"collection":[{"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/comments?post=308"}],"version-history":[{"count":0,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/posts\/308\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/media\/718"}],"wp:attachment":[{"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/media?parent=308"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/categories?post=308"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/tags?post=308"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}