{"id":310,"date":"2017-11-10T11:19:39","date_gmt":"2017-11-10T11:19:39","guid":{"rendered":"http:\/\/qantumthemes.xyz\/fluid\/demo2\/?p=310"},"modified":"2017-11-10T11:19:39","modified_gmt":"2017-11-10T11:19:39","slug":"the-best-in-edm-music","status":"publish","type":"post","link":"https:\/\/vice.qantumthemes.xyz\/dhrk\/music-production\/the-best-in-edm-music\/","title":{"rendered":"The Best in EDM Music!"},"content":{"rendered":"<p>Partying and music festivals in Mumbai has been looking better and better with every passing night. With new clubs, bars and pubs opening all over the city, nightlife has been thriving. The same can be said for DJs and clubs, which seem to be sprouting all over the metropolis we know as Mumbai. With bars and lounges gaining popularity among young individuals in the city, the night time scene in Mumbai has definitely stepped its game up. While the local bars and lounges are all well and good, the music concerts happening in Mumbai are unbelievable. International DJS are flocking to Aamchi Mumbai, owing to the large crowds and the atmosphere of Mumbai. Some big names who have come to Mumbai for concerts include big ticket artists like Armin van Buuren, Hardwell, Dimitri Vegas, Swedish House Mafia, and many more EDM artists.<\/p>\n<p>Another one of Mumbai&#8217;s DJS will be seen performing soon, DJ Shiva. Known for his foot tapping Bollywood and Hollywood remixes, the DJ does not stick to the convention when it comes to his brand of music. Effortlessly fusing Hip Hop, mainstream Bollywood, lounge, electro and house music, it makes his repertoire far more versatile than most performing artists. Having worked in the music industry for over a decade, the talented DJ has risen from where he&#8217;d begun, 10 years ago. He&#8217;s carved a niche for himself, with his hard work, unrelenting dedication and his unbridled passion for music. He has also been awarded with a bevy of accolades for his work with music. Some of his famous remixes include Aaj Phir, fro Hate Story 2, Yaariyaan, Raghupati Raghav, from Krrish 3 and Dil Tu Hi Bata. He&#8217;s already performed at more than a few high profile events, some of which include Trikaya at Pune, Flags at Pune with Perizad, IPL Nights, Party Link and many more.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Partying and music festivals in Mumbai has been looking better and better with every passing night. With new clubs, bars and pubs opening all over the city, nightlife has been thriving. The same can be said for DJs and clubs, which seem to be sprouting all over the metropolis we ...<\/p>\n","protected":false},"author":1,"featured_media":720,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[13],"tags":[2,12,10],"_links":{"self":[{"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/posts\/310"}],"collection":[{"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/comments?post=310"}],"version-history":[{"count":0,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/posts\/310\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/media\/720"}],"wp:attachment":[{"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/media?parent=310"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/categories?post=310"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/tags?post=310"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}