{"id":324,"date":"2017-11-10T11:22:48","date_gmt":"2017-11-10T11:22:48","guid":{"rendered":"http:\/\/qantumthemes.xyz\/fluid\/demo2\/?p=324"},"modified":"2017-11-10T11:22:48","modified_gmt":"2017-11-10T11:22:48","slug":"new-zealand-music-festival-survey","status":"publish","type":"post","link":"https:\/\/vice.qantumthemes.xyz\/dhrk\/club-music\/new-zealand-music-festival-survey\/","title":{"rendered":"New Zealand Music Festival Survey"},"content":{"rendered":"<div id=\"article-content\">\n<p>The rise of Lorde and electronic dance music, or EDM, across the world has brought a new level of attention to music festivals in the country of New Zealand. The country is currently producing a number of leading popular musicians and acts and is the birthplace of the latest worldwide pop sensation, Lorde(1). The music scene supported the rise of acts Gotye, The Naked and Famous and Mt. Eden.<\/p>\n<p><strong>Music Festivals NZ<\/strong><\/p>\n<p>Music festivals have experienced the subsequent rise in attendance and prominence as well(2). They&#8217;ve been able to attract larger acts to the country both as openers for their own success stories and artists who are looking to make a wave in a new market. This has been especially prevalent in the dance music world, with prominent EDM acts such as Chet Faker, Peking Duk, Poniiboi and Hardwell headlining events in the country.<\/p>\n<p>Because of this, a survey was conducted bout the various music festivals that have or are occurring in New Zealand this year and it shows that more people than ever are getting off the fence when it comes to attending the music festivals NZ throws. Over 30% of people surveyed said that they actually attend festivals, while just over 20% say that they do not normally attend, but they do check the line-ups. Those people are sure to find their way into music festivals because of the ever-larger names that New Zealand continues to attract!<\/p>\n<p><strong>Most Popular Music Festivals<\/strong><\/p>\n<p>The Rhythm and Vines (2) festival continues to be the most popular of all of the music festivals NZ holds with 13% of people surveyed saying that they look forward to it every year. The BW Summer Festival comes in second on this festival survey. Over 32% of people have not chosen a favourite music festival.<\/p>\n<p><strong>Favourite Music Acts<\/strong><\/p>\n<p>With all of the big names that have been coming to festivals in New Zealand lately, it is also difficult for people to pick a favourite act from any of these festivals. The festival survey found that three of the top five acts at festivals in New Zealand were from the dance genre &#8211; Chet Faker(3), Peking Duk(4) and Flume(5) &#8211; indicating that EDM is perhaps the most popular genre of music when it comes to festivals. The survey also had Maxwell and Bastille as the other top two acts that people enjoy.<\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>The rise of Lorde and electronic dance music, or EDM, across the world has brought a new level of attention to music festivals in the country of New Zealand. The country is currently producing a number of leading popular musicians and acts and is the birthplace of the latest worldwide ...<\/p>\n","protected":false},"author":1,"featured_media":715,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[6],"tags":[14,8,16],"_links":{"self":[{"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/posts\/324"}],"collection":[{"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/comments?post=324"}],"version-history":[{"count":0,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/posts\/324\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/media\/715"}],"wp:attachment":[{"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/media?parent=324"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/categories?post=324"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/tags?post=324"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}