{"id":330,"date":"2017-11-10T11:23:49","date_gmt":"2017-11-10T11:23:49","guid":{"rendered":"http:\/\/qantumthemes.xyz\/fluid\/demo2\/?p=330"},"modified":"2017-11-10T11:23:49","modified_gmt":"2017-11-10T11:23:49","slug":"rise-of-electronic-music","status":"publish","type":"post","link":"https:\/\/vice.qantumthemes.xyz\/dhrk\/club-music\/rise-of-electronic-music\/","title":{"rendered":"Rise of Electronic Music"},"content":{"rendered":"<p>Electronic music was born in the discos and nightclubs nationwide in the early eighties. Today, this genre of music, also known as Electronic Dance Music or EDM is a music largely created by disk jockeys with a purpose of creating environment for dance-based entertainment.<\/p>\n<p>EDM soon became one of the most popular music genres all around the world and some of the forms of electronic music are Breakbeat, Dance-punk, Eurodance, Freestyle, House, Techno and Trance. Though the roots of electronic music are based in the disco music which was very popular in the 1970s it was only in 1990s, that this type music was widely accepted and it became one of the contemporary music styles in following years. Electronic music is generally created by means of electronic equipments and instruments like synthesizers, drum machines and sequencers and it mimics the unique sounds of the traditional acoustic instrumentation.<\/p>\n<p>Apart from electro music genres like trance, techno, house and breakbeat which are primarily intended for dancing. Some genres of electronic music like IDM and trip hop are more associated with listening rather than body movements. Trance, which is also one of the forms of electronic genre of music, is a combination of techno, house and industrial music. The name is undoubtedly linked to perceive the ability of music to induce an altered state of consciousness.<\/p>\n<p>With the growth of computers and music technologies, and reduction in the cost of music equipments, a number of upcoming artists and disk jockeys have emerged, showcasing their talent and taking electronic music to the next level. Also, with the advent of hard disk recording system, it is possible for any computer user to become a musician, hence we see a rising trend of bedroom bands where often only single player is the band himself.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Electronic music was born in the discos and nightclubs nationwide in the early eighties. Today, this genre of music, also known as Electronic Dance Music or EDM is a music largely created by disk jockeys with a purpose of creating environment for dance-based entertainment. EDM soon became one of the ...<\/p>\n","protected":false},"author":1,"featured_media":719,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[6],"tags":[15,5],"_links":{"self":[{"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/posts\/330"}],"collection":[{"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/comments?post=330"}],"version-history":[{"count":0,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/posts\/330\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/media\/719"}],"wp:attachment":[{"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/media?parent=330"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/categories?post=330"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/vice.qantumthemes.xyz\/dhrk\/wp-json\/wp\/v2\/tags?post=330"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}